---
title: OffsetSurface
classe: Autodesk.Revit.DB.OffsetSurface
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Surface
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# OffsetSurface

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Surface GetBasisSurface()` | `offsetSurface.GetBasisSurface()` | Surface |
| `Double GetOffsetDistance()` | `offsetSurface.GetOffsetDistance()` | Double |
| `Boolean IsOrientationSameAsBasisSurface()` | `offsetSurface.IsOrientationSameAsBasisSurface()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```